Repository: 84000/data-translation-memory
Catalog: toh229-v4.tmx
Source language: bo
Languages: en

source: ཡིད་ཀྱི་ལས་གཅིག་པོ་མི་འཐུན་པ་དེ་དང་བྲལ་བར་འགྱུར་བ་སྟེ།
en: They will be free from the discordant mental actions.

source: གང་ཞེ་ན།
en: What are those?

source: དེས་སྨྲ་བ་སྔོན་དུ་བཏང་སྟེ།
en: They prepare their speech.

source: ཚིག་བརྗོད་པ་ན་གང་ཡིད་ཀྱི་ལས་མི་འཐུན་པའི་རྗེས་སུ་འཇུག་པ་དང་བྲལ་བར་འགྱུར་བ་ཡིན་ནོ།
en: They will not pursue discordant mental actions when they speak.

source: །སེམས་གཡེངས་པར་མི་འགྱུར་རོ། །སེམས་ལ་གནོད་པར་མི་འགྱུར་རོ།
en: They will not be mentally distracted. They will not be mentally injured.

source: །སེམས་འདུ་ཤེས་ཅན་དུ་མི་འགྱུར་རོ།
en: They will not entertain false ideas in the mind.

source: །དེའི་སེམས་ལ་མི་འཐུན་པ་མེད་པར་འགྱུར་རོ།
en: They will not have any discordance with respect to their minds.

source: །བློ་དང་ལྡན་པར་འགྱུར་རོ། །རྟོགས་པ་དང་ལྡན་པར་འགྱུར་རོ། །ངེས་པར་འགྱུར་རོ།
en: They will gain intelligence, understanding, and certainty.

source: །སྤྱོད་པ་དང་ལྡན་པར་འགྱུར་རོ། །ཆོ་ག་ལ་མཁས་པར་འགྱུར་རོ།
en: They will gain proper conduct, and they will become skilled in behavior.

source: །བརྟག་པ་ཕུན་སུམ་ཚོགས་པར་འགྱུར་རོ། །གཡོག་ཕུན་སུམ་ཚོགས་པར་འགྱུར་རོ།
en: They will gain excellence in analysis, service, and deportment.

source: །སྤྱོད་ལམ་ཕུན་སུམ་ཚོགས་པར་འགྱུར་རོ། །དྲན་པ་དང་ལྡན་ཞིང་མི་གཡོ་བར་འགྱུར་རོ།
en: They will become endowed with mindfulness and become unshakable in it.

source: །སེམས་མི་སྒུལ་ཞིང་བརྟན་པར་འགྱུར་རོ།
en: Their mind will become unmoving and stable.

source: །ཡོན་ཏན་སྒྲུབ་པར་འགྱུར་རོ།
en: They will attain qualities.

source: །སེམས་འཇམ་པར་འགྱུར་རོ།
en: Their mind will become soft.

source: །ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: They will become nonregressing.

source: །སེམས་མི་གཡོ་བར་འགྱུར་རོ།
en: Their mind will be unshakeable.

source: །སེམས་དང་འཐུན་པར་འགྱུར་ཏེ།
en: They will be in harmony with their mind.

source: སེམས་བརྟན་པ་དེ་དང་། ཕྱིར་མི་ལྡོག་པ་དེ་ལ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་གཟིགས་བཞེད་པར་འགྱུར་ལ།
en: The blessed buddhas will gaze upon those stable-minded and nonregressing beings.

source: ལྷ་རྣམས་ཀྱང་ལྟ་འདོད་པར་འགྱུར་ཞིང་ཀླུ་རྣམས་དང་། གནོད་སྦྱིན་རྣམས་དང་། དྲི་ཟ་རྣམས་དང་། མི་འམ་ཅི་རྣམས་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་དང་། མི་རྣམས་དང་། མི་མ་ཡིན་པ་རྣམས་ཀྱང་ལྟ་འདོད་པར་འགྱུར་རོ།
en: Gods, nāgas, yakṣas, gandharvas, kinnaras, mahoragas, humans, and asuras will desire to look upon them.

source: །དེ་ལ་ལྷ་རྣམས་ཀྱང་སྙན་པར་སྨྲ་ཞིང་ཀླུ་རྣམས་དང་། དྲི་ཟ་རྣམས་དང་། གནོད་སྦྱིན་རྣམས་དང་། མི་འམ་ཅི་རྣམས་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་དང་། མི་རྣམས་དང་། མི་མ་ཡིན་པ་རྣམས་ཀྱང་སྙན་པར་སྨྲ་ལ། དེ་ལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱང་སྙན་པ་གསུང་བར་འགྱུར་རོ། །
en: Gods, nāgas, yakṣas, gandharvas, kinnaras, mahoragas, humans, asuras, and even the blessed buddhas will speak sweetly to them.

source: ལྷ་རྣམས་དང་། ཀླུ་རྣམས་དང་། གནོད་སྦྱིན་རྣམས་དང་། དྲི་ཟ་རྣམས་དང་། མི་འམ་ཅི་རྣམས་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་དང་། མི་རྣམས་དང་། མི་མ་ཡིན་པ་རྣམས་ཀྱིས་བསྔགས་པར་བྱ་ཞིང་།
en: Gods, as well as nāgas, yakṣas, gandharvas, kinnaras, mahoragas, humans, asuras, and even the blessed buddhas, will praise them.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ཀྱང་བསྔགས་པར་བྱ་བ་སྟེ། དེ་ཉིད་འོང་བ་ལ་ཡང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཆོས་ཉེ་བར་སྒྲུབ་པར་མཛད་དོ།
en: The blessed buddhas will even arrive before them and cause them to accomplish those qualities. “

source: །ཀུན་དགའ་བོ་གང་ལ་ལ་དག་མདོ་སྡེ་འདི་འཆང་ངམ། སྟོན་པ་དེ་དག་གིས་ནི་ཡོན་ཏན་བརྒྱ་པོ་མང་པོ་ལ་རེ་བར་བྱའོ།
en: Ānanda, those who preserve or teach this discourse can expect many hundreds of qualities.

source: །ཀུན་དགའ་བོ་ཆོས་ཀྱི་རྣམ་གྲངས་འདིར་ནི་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་བྱང་ཆུབ་བསྡུས་སོ།
en: Ānanda, this Dharma teaching contains the awakening of all the buddhas.

source: །ཀུན་དགའ་བོ་དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is that, Ānanda?

source: འདིར་ནི་ཆོས་ཐམས་ཅད་བསྡུས་པའི་ཕྱིར་ཏེ།
en: Because all phenomena are subsumed within it.

source: དེ་ནི་སངས་རྒྱས་བགྲོ་བ་འདི་ཡིན་ནོ།
en: That is the discussion about buddhas.

source: །ཀུན་དགའ་བོ་སངས་རྒྱས་བགྲོ་བ་དང་། དེ་བཞིན་གཤེགས་པ་བགྲོ་བ་དང་། ཆོས་བགྲོ་བ་འདི་ནི་སྐྱེས་བུ་དམན་པ་རྣམས་ཀྱི་ལག་ཏུ་འོང་བར་མི་འགྱུར་ཞིང་། ལེ་ལོ་ཅན་རྣམས་ཀྱི་ལག་ཏུ་འོང་བར་མི་འགྱུར་ཏེ།
en: Ānanda, this discussion about buddhas, this discussion about thus-gone ones, this discussion about the Dharma, will not pass into the hands of inferior beings and slothful individuals.

source: སེམས་ཅན་དེ་དག་ནི་དམན་པར་མི་འགྱུར་རོ།
en: Those beings will not be inferior.

source: །ཀུན་དགའ་བོ་གཞན་ཡང་སངས་རྒྱས་བགྲོ་བ་འདི་གང་དག་གི་ལག་ཏུ་འོང་བར་འགྱུར་བའི་སེམས་ཅན་དེ་དག་ནི་བརྩོན་འགྲུས་བརྩམས་པར་འགྱུར་ལ།
en: Furthermore, Ānanda, those beings into whose hands this discussion about buddhas is passed will cultivate diligence.

source: སེམས་ཞུམ་པ་མེད་པ་རྣམས་དང་། སེམས་ཚར་བཅད་པ་རྣམས་ཀྱི་ལག་ཏུ་འོང་བར་འགྱུར་རོ།
en: It will pass into the hands of those who are undaunted and have subjugated their mind. “

source: །ཀུན་དགའ་བོ་སངས་རྒྱས་བགྲོ་བ་འདི་སེམས་ཅན་སེམས་ཚར་མ་བཅད་པ་རྣམས་ཀྱི་ལག་ཏུ་འགྲོ་བར་མི་འགྱུར་རོ།
en: Ānanda, those beings who have not subjugated their mind will not remember this discussion about buddhas.

source: །ཀུན་དགའ་བོ་གཞན་ཡང་འདི་ནི་བདུད་རྣམ་པར་འཇོམས་པར་རིག་པར་བྱའོ།
en: Moreover, Ānanda, you should understand that this teaching overcomes Māra.

source: །ཀུན་དགའ་བོ་བདུད་སྡིག་ཅན་ནི་མདོ་སྡེ་འདི་ནུབ་པར་བྱ་བའི་ཕྱིར་བརྩོན་པར་བྱེད་དེ།
en: Ānanda, evil Māra will work diligently to degrade this discourse.

source: ཀུན་དགའ་བོ་དེ་ལ་བདུད་ཀྱི་ལས་ཕྲ་བ་རྣམས་དང་། བདུད་ཀྱི་ལས་ཤིག་ཤིག་པོ་རྣམས་དང་། བདུད་ཀྱི་ལས་ཐག་རིང་བ་རྣམས་སུ་བལྟ་ཞིང་བདུད་ཀྱི་ལས་རྣམས་ཕམ་པར་ཡང་བལྟ་བར་བྱའོ།
en: Ānanda, you must therefore examine the subtle acts of Māra, the careless acts of Māra, and the distant acts of Māra, and you must also examine how to conquer the acts of Māra.

source: །ཀུན་དགའ་བོ་གཞན་ཡང་མདོ་འདི་ལས་བདུད་ཀྱི་ལས་མང་པོ་དག་འབྱུང་བར་འགྱུར་ཏེ།
en: Moreover, Ānanda, in relation to this discourse, many acts of Māra will arise.

source: དེ་ལ་བདུད་ཀྱི་ལས་ཐག་རིང་བ་རྣམས་ཇི་ལྟ་བུར་བལྟ་ཞེ་ན།
en: How should the distant acts of Māra be seen?

source: མདོ་འདི་ནི་ཧ་ཅང་ཐག་རིང་བའོ། །མདོ་འདི་ནི་ཧ་ཅང་རྒྱ་ཆེ་བའོ། །མདོ་འདི་ནི་ཧ་ཅང་བར་ཆད་མང་བའོ། །མདོ་འདི་ནི་ཧ་ཅང་གཡེང་བ་མང་བའོ། །མདོ་འདི་ནི་ཧ་ཅང་ཉོན་མོངས་པ་མང་བའོ་ཞེས་ཏེ། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་མདོ་འདིའི་ཡོན་ཏན་དེ་ལྟར་མ་ཤེས་ནས། དེ་དག་གིས་མ་ཤེས་པ་ན་བདུད་ཀྱི་ལྕགས་ཀྱུས་ཟིན་ཅིང་བདུད་ཀྱི་ཞགས་པས་བཅིངས་ནས་མདོ་འདི་ལ་བརྩོན་པར་མི་བྱེད།
en: Noble sons and daughters who do not understand the qualities of this discourse will say, ‘This discourse is too distant and too vast; there are too many obstacles, too many distractions, and too many afflictions.’ Such noble sons and daughters who do not understand the qualities of this discourse in this way have been hooked and lassoed by Māra. Hence, they will not exert themselves in this discourse.

source: འཛིན་པར་མི་བྱེད། འཆང་བར་མི་བྱེད། ཀུན་ཆུབ་པར་མི་བྱེད། སྟོན་པར་མི་བྱེད་དོ།
en: They will not remember it, preserve it, understand it, or teach it to others. “

source: །ཀུན་དགའ་བོ་སེམས་ཅན་རྣམས་ཇི་ཙམ་གྱིས་ཉམས་པར་འགྱུར་བ་ལྟོས་ཤིག །
en: Ānanda, look at how beings have degenerated!

source: ལ་ལ་ཞིག་གིས་དེ་བཞིན་གཤེགས་པ་བགྲོ་བ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པར་མི་བྱེད་ཅིང་འཆང་བར་མི་བྱེད་ལ། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་མི་སྟོན་པ་ནི་ཀུན་དགའ་བོ་འདི་ལྟར་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཡང་དག་པའི་ཕུལ་ལ་བརྙས་པ་ཡིན་ཏེ།
en: Someone who does not remember this Dharma teaching on the discussions about thus-gone ones and who does not preserve it or promulgate it widely, Ānanda, will be disrespecting the most excellent awakening of the buddhas.

source: ལེགས་པ་མ་ཡིན་ནོ། །ཤིན་ཏུ་ལེགས་པ་མ་ཡིན་ནོ།
en: That is not good—it is not good at all.

source: །ཀུན་དགའ་བོ་གང་དག་གིས་མདོ་སྡེ་འདི་ལ་བརྙས་པ་དེ་དག་གིས་ནི་ཆོས་ལ་ཡང་བརྙས་པ་ཡིན་ནོ།
en: Ānanda, anyone who disrespects this discourse is also disrespecting the Dharma.

source: །ཀུན་དགའ་བོ་གཞན་ཡང་གང་དག་གིས་མདོ་སྡེ་འདི་ལ་བརྙས་པར་བྱེད་པ་དེ་དག་ལ་སྐུལ་བ་འདིས་ཇིར་ཡང་མི་འགྱུར་རོ།
en: Moreover, Ānanda, those who disrespect this discourse will not be swayed whatsoever by this admonition.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is that?

source: འདི་ལྟར་སྐྱེས་བུ་རྨོངས་པ་དེ་དག་ནི་མངོན་པར་བརྩོན་པ་མ་ཡིན་ཏེ།
en: Such confused individuals do not make any effort.

source: དེ་དག་ལ་བསྐུལ་བ་ན་རང་གི་སེམས་ཀྱང་མི་ཤེས་ཤིང་རང་གི་གནས་ཀྱང་མི་ཤེས་ལ། དེ་དག་མི་ཤེས་པས་བསྐུལ་བ་ཡང་འཛིན་པར་མི་བྱེད་དོ།
en: They do not understand their own mind or their own condition, so when one admonishes them, they will not remember that admonition.

source: །ཀུན་དགའ་བོ་གཞན་ཡང་འདིར་དེ་བཞིན་གཤེགས་པ་ལ་བརྙས་པ་བྱས་པར་འགྱུར་བ་དང་། ཆོས་ལ་བརྙས་པར་བྱེད་པ་ཅི་ཞིག་ཡོད་དེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ནི་ཆོས་ཉིད་ཀྱིས་མ་བརྙས་པའོ།
en: Moreover, Ānanda, regarding those who disrespect the thus-gone ones and the Dharma, the blessed buddhas cannot by nature be disrespected.

source: །ཀུན་དགའ་བོ་སྐྱེས་བུ་རྨོངས་པ་དེ་དག་ནི་ཡང་དག་པ་མ་ཡིན་པའི་ཆོས་རྣམས་ལས་ཡོངས་སུ་ཉམས་པས་བདག་ཉིད་ལ་བརྙས་པར་འགྱུར་གྱི།
en: Ānanda, those confused individuals have been corrupted by inauthentic teachings.

source: གང་དག་དེ་བཞིན་གཤེགས་པ་ལ་བརྙས་པར་འགྱུར་བའམ། ཆོས་ལ་བརྙས་པར་འགྱུར་བ་ནི་མེད་དོ།
en: Therefore, they are disrespecting themselves; there is no harm being done to the thus-gone ones or the Dharma.

source: །ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པས་ནི་བརྙས་པ་མེད་པའི་ཆོས་ཐུགས་སུ་ཆུད་ལ།
en: Ānanda, the thus-gone ones have mastered the Dharma, which is beyond being disrespected.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་བརྙས་པ་མེད་པའོ།
en: The blessed buddhas also cannot be disrespected.

source: །ཀུན་དགའ་བོ་དེ་ལྟ་བས་ན་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་བརྙས་པར་མི་འགྱུར་བ་དང་། ཕྱས་སུ་མི་འགྱུར་བར་ཆོས་འདི་དག་ཁོང་དུ་ཆུད་པར་བྱའོ།
en: Hence, Ānanda, you must master these teachings without disrespecting or disparaging the qualities of the Buddha.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། འཇམ་དཔལ་འདི་ནས་འཇིག་རྟེན་གྱི་ཁམས་འབུམ་ཕྲག་ཚད་མེད་ཅིང་དཔག་ཏུ་མེད་པ་དག་འདས་པའི་ཕ་རོལ་ན། འཇིག་རྟེན་གྱི་ཁམས་ཟླ་འཕགས་འོད་ཟེར་ཅེས་བྱ་བ་དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མ་མངོན་འཕགས་འོད་ཟེར་རོལ་པ་ཞེས་བྱ་བ་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་སོ།
en: Then, the Blessed One addressed youthful Mañjuśrī, “Mañjuśrī, immeasurable and incalculable worlds beyond this one is the world called Light Rays of the Exalted Moon. There, the thus-gone, worthy, perfect Buddha Exalted Lotus Beaming Light resides, flourishes, and prospers.

source: །འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་དེའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་རིན་པོ་ཆེ་སྣ་བདུན་ལས་གྲུབ་པའི་པད་མ་དག་གིས་རྒྱས་པར་གྱུར་ཏེ།
en: Mañjuśrī, the world system of that thus-gone one is adorned with lotus flowers made of the seven precious materials.

source: པད་མ་དེ་དག་གི་དབུས་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་སྐྱིལ་མོ་ཀྲུང་བཅས་བཞིན་དུ་བྱུང་ལ། པད་མ་དེ་དག་ལས་ཀྱང་འོད་ཟེར་བྱུང་ངོ་།
en: Bodhisattvas seated in the cross-legged posture have arisen from the center of those lotuses, and from those lotuses light streams forth.

source: །བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་འོད་ཟེར་དེ་དག་ལས་སྤྲུལ་པ་སྤྲུལ་པར་བྱེད་དེ།
en: The bodhisattvas then create emanations made from that light.

source: སྤྲུལ་པ་དཔག་ཏུ་མེད་པ་དག་སྤྲུལ་པར་བྱེད་ཅིང་སྤྲུལ་པས་ཆོས་ཀྱང་སྟོན་ཏོ།
en: They emit incalculable emanations, and those emanations teach the Dharma.

source: །འཇམ་དཔལ་འོད་ཟེར་དེ་དག་གིས་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་དྲུག་ཅུ་སྙེད་དག་སྣང་བས་གསལ་བར་བྱས་སོ།
en: Mañjuśrī, that light has illuminated as many world systems as there are grains of sand in sixty Ganges rivers. “

source: །འཇམ་དཔལ་དཔེར་ན་སྟོན་ཀའི་དུས་སུ་ནམ་མཁའ་དག་ཅིང་དྲི་མ་མེད་ལ་ཆར་སྤྲིན་མེད་པ། ཟླ་བ་ཡར་གྱི་ཚེས་བཅྭ་ལྔའི་ནམ་གྱི་གུང་ཐུན་ལ་ཟླ་བའི་དཀྱིལ་འཁོར་སྤྲིན་མེད་ཟླ་བའི་འོད་ཟེར་གྱིས་ཀུན་དུ་གསལ་བར་སྣང་བ་དེའི་ཚེ་འཛམ་བུའི་གླིང་ཁོར་ཡུག་ཏུ་སྣང་བས་ཤིན་ཏུ་ཁྱབ་པར་འགྱུར་རོ།
en: To give an analogy, Mañjuśrī, in a clear and stainless autumn sky free of clouds, during the middle of the night on the fifteenth day of the waxing moon, the light of the full moon will shine brightly, unobscured by clouds. At that time the whole of the world is brimming with light.

source: །འཇམ་དཔལ་དེ་བཞིན་དུ་འཇིག་རྟེན་གྱི་ཁམས་ཟླ་འཕགས་འོད་ཟེར་དེ་ཁོར་ཡུག་ཏུ་ཡང་སྣང་བས་ཤིན་ཏུ་ཁྱབ་པར་འགྱུར་རོ། །
en: In the same way, Mañjuśrī, the entire world Light Rays of the Exalted Moon is brimming with light.

source: དེ་བཞིན་དུ་ཤར་དང་། ལྷོ་དང་། ནུབ་དང་། བྱང་དང་། དེ་བཞིན་དུ་སྟེང་དང་། དེ་བཞིན་དུ་འོག་དང་། དེ་བཞིན་དུ་ཕྱོགས་མཚམས་དང་། དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་དག་ཏུ་ཡང་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་དྲུག་ཅུ་སྙེད་དག་སྣང་བས་གསལ་བར་བྱས་སོ།
en: To the east, south, west, and north, as well as above, below, and in the intermediate directions—in all the ten directions—as many worlds as there are grains of sand in sixty Ganges rivers are also illuminated in that same way.

source: །འཇམ་དཔལ་རྒྱུ་དེས་ན་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཀྱི་མིང་ཟླ་འཕགས་འོད་ཟེར་ཅེས་བྱའོ།
en: For that reason, Mañjuśrī, that world system is known as Light Rays of the Exalted Moon. “

source: །འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་དེ་ཆོས་སྟོན་པའི་སྤྱི་བོ་ནས་པད་མ་བྱུང་སྟེ།
en: Mañjuśrī, when that thus-gone one teaches the Dharma, a lotus emerges from the crown of his head.

source: པད་མ་དེ་དག་ལས་འོད་ཟེར་བྱུང་བས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་སྣང་བར་བྱས་སོ།
en: The lotus shines a light that illuminates the entire trichiliocosm.

source: །འོད་ཟེར་དེ་དག་ལས་ཀྱང་སངས་རྒྱས་ཀྱི་སྐུ་བྱུང་སྟེ། སངས་རྒྱས་ཀྱི་སྐུ་དེ་དག་གིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་དེ་ལ་པད་མ་དག་གིས་གཏོར་ཏོ། །མངོན་པར་གཏོར་ཏོ།
en: From the light, buddhas appear, and those buddhas then sprinkle and scatter lotus flowers on the Thus-Gone One.

source: །འཇམ་དཔལ་པད་མ་གཏོར་བ་དེ་དག་ཉིད་ཀྱང་དེ་བཞིན་གཤེགས་པའི་སྐུར་གནས་སོ།
en: Mañjuśrī, the lotuses that are scattered then abide within the body of the Thus-Gone One.

source: །འཇམ་དཔལ་འདི་ལྟར་བཅོམ་ལྡན་འདས་དེའི་སྔོན་གྱི་སྨོན་ལམ་གྱི་རྒྱུས་ན། བཅོམ་ལྡན་འདས་དེ་པད་མ་མངོན་འཕགས་ཞེས་བྱའོ།
en: In that way, Mañjuśrī, because of his past aspirations, that blessed one is known as Exalted Lotus.

source: །འཇམ་དཔལ་དེ་ནས་ངས་དེ་བཞིན་གཤེགས་པ་པད་མ་མངོན་འཕགས་འོད་ཟེར་རོལ་པ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དེ་བཞིན་གཤེགས་པ་པད་མ་མངོན་འཕགས་འོད་ཟེར་རོལ་པས་ཅི་ལ་གནས་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས།
en: Mañjuśrī, I asked the thus-gone Exalted Lotus Beaming Light, ‘On what basis did the thus-gone Exalted Lotus Beaming Light fully awaken to unexcelled and perfect buddhahood?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། དེས་ང་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འདས་པ་དང་མ་འོངས་པའི་སེམས་གང་ལ་གནས་ནས་དེ་ལྟར་བྱང་ཆུབ་པ་དེ་ལྟ་བུ་ལ་གནས་ཏེ།
en: He responded, ‘Awakening abides on the same basis as past thoughts and future thoughts.

source: ང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: I fully awakened to unexcelled and perfect buddhahood on such a basis.’

source: །འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་འདས་པ་དང་མ་འོངས་པའི་སེམས་ཅི་ལ་གནས་ལགས།
en: ” Mañjuśrī asked, “Blessed One, what is the basis of past thoughts and future thoughts?”

source: བཀའ་སྩལ་པ། འཇམ་དཔལ་གང་འདས་པའི་སེམས་དེ་ནི་མ་སྐྱེས་པའོ།
en: The Blessed One replied, “Mañjuśrī, past thoughts are unborn.

source: །འཇམ་དཔལ་གང་མ་འོངས་པའི་སེམས་དེ་ཡང་མ་སྐྱེས་པའོ།
en: Future thoughts are also unborn.

source: །གང་ད་ལྟར་བྱུང་བའི་སེམས་དེ་ཡང་མ་སྐྱེས་པའོ།
en: Present thoughts are also unborn.

source: །གང་མི་སྐྱེ་བ་དེ་ནི་དེ་བཞིན་ཉིད་བྱང་ཆུབ་པར་བྱ་བའི་ཕྱིར་ཏེ་དེ་ནི་བྱང་ཆུབ་བོ།
en: That which is unborn is suchness, which is awakening. Therefore, it is awakening.

source: །འཇམ་དཔལ་དཔེར་ན་འདས་པའི་སྒྱུ་མ་ཡང་ཡོད་པ་མ་ཡིན་ནོ། །མ་འོངས་པའི་ཡང་ཡོད་པ་མ་ཡིན་ལ། ད་ལྟར་བྱུང་བའི་ཡང་ཡོད་པ་མ་ཡིན་ཏེ།
en: For example, Mañjuśrī, past illusions do not exist, nor do future illusions or present illusions.

source: རང་གི་ངོ་བོས་དབེན་ཞིང་རང་གི་ངོ་བོ་དང་བྲལ་བ་ཡིན་ནོ།
en: They are devoid of intrinsic existence—they lack intrinsic existence.

source: །འཇམ་དཔལ་དེ་བཞིན་དུ་གང་འདས་པའི་སེམས་དེ་ནི་མ་སྐྱེས་པའོ། །གང་མ་འོངས་པའི་སེམས་དེ་ཡང་མ་སྐྱེས་པའོ། །གང་ད་ལྟར་བྱུང་བའི་སེམས་དེ་ཡང་མ་སྐྱེས་པ་སྟེ།
en: Mañjuśrī, in the same way, past thoughts are unborn, future thoughts are unborn, and present thoughts are unborn.

source: བྱང་ཆུབ་དེ་ནི་དེ་ལྟ་བུ་ཡིན་ནོ།
en: Awakening is like that.

source: །འཇམ་དཔལ་བྱང་ཆུབ་ནི་འདས་པ་ཡང་མ་ཡིན། མ་འོངས་པ་ཡང་མ་ཡིན། ད་ལྟར་བྱུང་བ་ཡང་མ་ཡིན་ཏེ།
en: Mañjuśrī, awakening is not past, future, or present.

source: འཇམ་དཔལ་བྱང་ཆུབ་དེ་ནི་དེ་ལྟ་བུ་ཡིན་ནོ།
en: Mañjuśrī, awakening is like that.

source: །འཇམ་དཔལ་འདི་ལྟར་བྱང་ཆུབ་ནི་ཡོད་པ་ཡང་མ་ཡིན། འཇམ་དཔལ་བྱང་ཆུབ་དེ་ནི་མེད་པ་ཡང་མ་ཡིན་ནོ།
en: In this way, Mañjuśrī, awakening is neither existent nor nonexistent.

source: །འཇམ་དཔལ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ནི་བྱང་ཆུབ་ཀྱང་ཡིན་ལ། ཆོས་ཐམས་ཅད་བྱང་ཆུབ་མ་ཡིན་པ་ཡང་མ་ཡིན་ནོ།། །།
en: Mañjuśrī, in this way all phenomena are awakening, yet all phenomena are also not awakening.

source: དེ་ནས་ཁྱིམ་བདག་དེད་དཔོན་བཟང་པོ་དང་། ཁྱིམ་བདག་རྣམ་པར་དག་སྤྱོད་དང་། ཁྱིམ་བདག་ཀླུ་དགའ་དང་། ཁྱིམ་བདག་འཛིན་མེད་དང་། ཁྱིམ་བདག་རྣ་གཙུག་དང་། ཁྱིམ་བདག་གཙུག་ན་ནོར་བུ་དང་། ཁྱིམ་བདག་རྣ་བ་གང་པོ་དང་། ཁྱིམ་བདག་དོན་གྲུབ་དང་། ཁྱིམ་བདག་རིན་ཆེན་གོམ་པས་འགྲོ་དང་། ཁྱིམ་བདག་དེ་དག་ཐམས་ཅད་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ལུས་ཐོགས་པ་མ་མཆིས་པ་ལགས་ཤིང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་བྱམས་པའི་སྤྱན་དང་ལྡན་ཏེ་ངོ་མཚར་བ་ལགས་ན།
en: At this point the householders Susārthavāha, Pure Conduct, Friend of the Nāgas, Without Fixation, Peaked Ears, Maṇicūḍa, Full Ears, Amoghasiddhi, and Precious Walker all said to the Blessed One, “Blessed One, the blessed buddhas have a body that is unimpeded, and the blessed buddhas have a loving gaze. That is amazing!

source: དགུང་ཟླ་གསུམ་པོ་འདི་ལ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དུ་ཙམ་ཞིག་དང་ཐབས་ཅིག་ཏུ་དེ་བཞིན་གཤེགས་པ་བགྲོ་བ་འདི་ལ་བགྲོ་བ་མཛད་ལགས།
en: For three months the Blessed One has been engaged in this discussion about thus-gone ones together with all those thus-gone ones.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱིམ་བདག་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One responded to the householders, “Householders, you must understand that the characteristics of a buddha cannot be assessed.”

source: ཁྱིམ་བདག་རྣམས་སངས་རྒྱས་ཀྱི་མཚན་ཉིད་ནི་གཞལ་བར་བྱ་བ་མ་ཡིན་གྱིས་ཐོང་ཤིག །དེ་ནས་ཁྱིམ་བདག་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་བགྲོ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དུ་ཙམ་ཞིག་དང་ཐབས་ཅིག་ཏུ་བགྲོ་བ་མཛད་པ་དཔེས་བསྟན་པར་སྤྱོད་ལགས་སམ།
en: The householders said to the Blessed One, “Blessed One, could you please give an analogy of the Blessed One discussing this Dharma teaching on discussions about thus-gone ones together with all those thus-gone ones?”

source: བཀའ་སྩལ་པ། ཁྱིམ་བདག་རྣམས་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ལ་བརྟག་པ་དང་། མངོན་པར་ཡིད་ཆེས་པར་བྱ་བ་དག་དཔེའི་སྒོ་ནས་ནི་
en: The Blessed One said, “Householders, I will give you an analogy so that you will discern and feel trust in the wisdom of the buddhas.

source: མཁས་པ་རྣམས་དང་། མོས་པ་མང་བ་རྣམས་དང་། ང་རྒྱལ་བཅོམ་པ་རྣམས་དང་། བློ་རྒྱ་ཆེ་བ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་པ་མཆོག་ལ་གནས་པ་དག་གིས་ཤེས་པར་ནུས་ཀྱི།
en: Wise ones, those with great faith, those who have conquered pride, those with great intelligence, and those who abide in the supreme and inconceivable wisdom of the buddhas will be able to understand.

source: བྱིས་པ་རྣམས་དང་། བདག་ཏུ་འདུ་ཤེས་པ་རྣམས་དང་། ང་རྒྱལ་གྱིས་ཉམས་པ་རྣམས་དང་། བློ་ཆུང་བ་རྣམས་ཀྱིས་ནི་མི་ནུས་པས་
en: However, childish, ordinary beings, those who perceive a self, those impaired by pride, and those with little intelligence will not be able to understand it.

source: དེའི་ཕྱིར་ལེགས་པར་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་།
en: For that reason, listen carefully and pay attention.

source: ངས་ཁྱོད་ལ་བཤད་དོ།
en: I shall now explain. “

source: །ཁྱིམ་བདག་རྣམས་དཔེ་ཡོངས་སུ་བརྟག་པ་ཉེ་བར་བཟུང་སྟེ།
en: Householders, consider this analogy.

source: གང་དག་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ནི་ཁོར་ཡུག་ཐེར་འབུམ་ཡོད་པར་ཉི་མ་ཐེར་འབུམ་འཁོར་ཞིང་གནས་སོ། །ཟླ་བ་ཐེར་འབུམ་འཁོར་ཞིང་གནས་སོ།
en: In this trichiliocosm, there are one billion worlds with one billion suns and one billion moons.

source: །ཁྱིམ་བདག་རྣམས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་རིའི་རྒྱལ་པོ་ཁོར་ཡུག་ཆེན་པོ་དག་གིས་ཡོངས་སུ་བསྐོར་ལ།
en: Householders, surrounding that trichiliocosm is an outer ring of lofty mountains.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དེའི་ཁོངས་ན་གང་དག་སེམས་ཅན་དུ་གདགས་པས་བཏགས་པ་སེམས་ཅན་ཐམས་ཅད་སྔ་ཕྱི་མེད་པར་མིའི་ལུས་ཐོབ་པར་གྱུར་ལ།
en: Within the trichiliocosm there are also all those sentient beings designated as sentient beings, without beginning or end, who attain a human body.

source: གང་དག་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་སའི་ཁམས་ཡོད་པ་དང་། རིན་པོ་ཆེ་དང་འདྲ་བའི་རྩྭ་དང་། ཤིང་དང་། ཡལ་ག་དང་། ལོ་མ་དང་། འདབ་མ་དག་ཉེ་བར་བཟུང་བ་དང་། རི་ཐམས་ཅད་དང་།
en: Within that world system there is the earth element and all the things that contain the earth element, such as jewel-like grass, trees, branches, leaves, and petals, as well as all the mountains.

source: དེ་དག་ལ་གང་དག་སའི་ཁམས་ཡོད་པ་དང་། ཇི་ཙམ་དུ་འབྱུང་བ་ཆེན་པོ་བཞི་གནས་པ་ལས་སའི་ཁམས་སུ་གདགས་པས་བཏགས་པ་དེ་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་དུ་རླགས་ན་ཁྱིམ་བདག་རྣམས་དེ་ཇི་སྙམ་དུ་སེམས།
en: Now, imagine that all of that, which is classified as the earth element among the four great elements, was pulverized into the smallest particles. Householders, what do you think?

source: རྡུལ་ཕྲ་རབ་དེ་དག་མང་བ་ཡིན་ནམ་དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: Would there be many such particles?”

source: ཁྱིམ་བདག་དེ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རྡུལ་ཕྲ་རབ་དེ་དག་མང་བ་ལགས་སོ།
en: The householders responded to the Blessed One, “Yes, Blessed One, there would be many such particles.

source: །རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་དེ་དག་ཤིན་ཏུ་མང་བ་ལགས་སོ།
en: There would be a great number of particles.

source: །བཅོམ་ལྡན་འདས་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་དེ་དག་ཚད་མ་མཆིས་པ་ལགས་སོ།
en: Blessed One, those smallest particles would be countless.”

source: །ཁྱིམ་བདག་རྣམས་གཞན་ཡང་ཡོངས་སུ་བརྟག་པ་ཉེ་བར་བཟུང་སྟེ།
en: The Blessed One said, “Moreover, householders, imagine the following.

source: སེམས་ཅན་རྣམས་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་དེ་དག་སྙེད་དུ་གྱུར་ཅིང་སེམས་ཅན་དེ་དག་ཀྱང་སྔ་ཕྱི་མེད་པར་མིའི་ལུས་ཐོབ་པར་གྱུར་ལ།
en: Consider how sentient beings, who are as numerous as those smallest particles, attain the human body without beginning or end.

source: དེ་དག་ཐམས་ཅད་ཀྱིས་མིའི་ལུས་ཐོབ་ནས་ཀྱང་རབ་ཏུ་བྱུང་ངོ་།
en: Once they attain the human body, all those beings might go forth into homelessness.

source: །དེ་དག་ཐམས་ཅད་རབ་ཏུ་བྱུང་ནས་ཀྱང་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་སྟེ། དེ་དག་མངོན་པར་ཤེས་པ་དག་མངོན་སུམ་དུ་བྱེད་ཅིང་།
en: Once they go forth into homelessness, all those beings might attain the level of a worthy one and manifest the superknowledges.

source: དེ་དག་མངོན་པར་ཤེས་པ་དྲུག་པོའི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་ཉན་ཐོས་ཆེན་པོ་དེ་དག་ཇི་སྙེད་པ་དེ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཁོ་ན་དག་ཉན་ཐོས་གཅིག་གིས་སེ་གོལ་འགའ་གཏོགས་པ་ཙམ་གྱིས་འདའ་བར་བྱེད་དོ།
en: Through the miraculous power of those six superknowledges, a single hearer would then be able to travel to a number of worlds equal to the total number of great hearers, all in the span of a snap of the fingers.

source: །ཁྱིམ་བདག་རྣམས་རྣམ་གྲངས་འདིས་ན་ཉན་ཐོས་ཆེན་པོ་རེ་རེས་ཀྱང་འདའ་བར་བྱེད་ལ།
en: Householders, each one of that number of great hearers would be able to travel in this way.

source: གལ་ཏེ་གཅིག་གིས་འདའ་བར་བྱེད་པས་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་གཞན་དང་གཞན་དུ་འགྲོ་བར་བྱེད་དེ།
en: As they pass by one world, they will continue to travel to yet further worlds.

source: ཁྱིམ་བདག་རྣམས་རྣམ་གྲངས་འདིས་ན་ཉན་ཐོས་ཆེན་པོ་དེ་དག་ལོ་བརྒྱ་སྙེད་དུ་འདའ་བར་བྱེད་ན།
en: Householders, imagine that all the great hearers continue to travel in this way for one hundred years.

source: ཁྱིམ་བདག་རྣམས་དེ་ཇི་སྙམ་དུ་སེམས།
en: Householders, what do you think?

source: ཉན་ཐོས་ཆེན་པོ་དེ་དག་གིས་ལོ་བརྒྱ་སྙེད་ཐལ་བར་འདའ་བའི་འཇིག་རྟེན་གྱི་ཁམས་ཇི་སྙེད་ཅིག་ཡོད།
en: How many worlds would those great hearers travel to in that span of one hundred years?” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཆེན་པོ་དེ་དག་གིས་འདའ་བའི་འཇིག་རྟེན་གྱི་ཁམས་ཇི་སྙེད་པ་དེ་དག་ནི་ཚད་མ་མཆིས་པ་ལགས་སོ།
en: Blessed One, the number of world systems those great hearers would pass by would be immeasurable.

source: །བཅོམ་ལྡན་འདས་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་གྲངས་མ་མཆིས་པ་ལགས་སོ།
en: Blessed One, the number of world systems would be countless.”
